# GetDefaultEndMarker

## Description
Gets all properties for the document default end marker. Return TRUE if operation was successful.

```pascal
FUNCTION GetDefaultEndMarker(
				VAR style          : LONGINT;
				VAR angle          : INTEGER;
				VAR size           : REAL;
				VAR width          : REAL;
				VAR thicknessBasis : INTEGER;
				VAR thickness      : REAL;
				VAR visibility     : BOOLEAN) : BOOLEAN;
```

```python

def vs.GetDefaultEndMarker():
    return (BOOLEAN, style, angle, size, width, thicknessBasis, thickness, visibility)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|style|LONGINT|The marker style. (see comments for details)|
|angle|INTEGER|The marker angle in degrees. (0 to 90)|
|size|REAL|The marker size in page inches.|
|width|REAL|The marker width in page inches.|
|thicknessBasis|INTEGER|The marker thickness basis. ( see comments for details)|
|thickness|REAL|The marker thickness.|
|visibility|BOOLEAN|The marker visibility.|

## Examples
```pascal
PROCEDURE Example;

VAR

	ok : BOOLEAN;

style: INTEGER;

	angle: INTEGER;

	size: REAL;

	width: REAL;

	thickBasis: INTEGER;

	thickness: REAL;

	visibility: BOOLEAN;

BEGIN

ok := GetDefaultEndMarker (style, angle, size, width, thickBasis, thickness, visibility);

Message (style, ' /  ', angle, '  /  ', size, '  /  ', width, ' /  ', thickBasis, ' /  ', thickness, ' /  ', visibility);

END;

RUN(Example);

```

## See Also
VS Functions:
GetDefaultBeginningMarker

## Version
Availability: from VectorWorks 2008
## Category
* Document Attributes